# ==================================================================================================================================================
# セリフ集 (対ボット用 / 対人間用)
#   ・TO_BOT   : Botの発言に対する返し
#   ・TO_HUMAN : 人間の発言に対する返し
# ==================================================================================================================================================

# --------------------------------------------------------------------------------------------------------------------------------------------------
# リリ
# --------------------------------------------------------------------------------------------------------------------------------------------------
# ナナ(Bot)の発言への返し:完全一致
LILI_TO_BOT = {
    "呼んだ？": "呼ばれてないよ…",
    "ふたりの": "ふたりのことが知りたいのなら～",
    "約束": "こんな物語をわわすれるくらいなら～",
    "大人のオの字も知りたくもないのさ～": "約束したのだ～",
    "秘密": "宇宙が～ふたりきり食べたおにぎりの～",
    "リリ": "君の青い髪が僕のイノセンスだった",
    "ナナ\nあなたは金色のシャンデリー": "ナナ…！",
    "彗星になれたなら": "夢のように愛して～\n愛のように夢をみて～",
    "夜魔": "普通に笑って普通に泣いて生きてみたかった～",
    "再会": "さんざめくこの世界にさよならを～",
    "深い青だった": "少女の鮮血は～\n海よりも\n涙よりも\n深い青だっつぁ～～～～～～",
    "手を繋いだまななら～": "二度と～",
    "来ない～": "さいか～～～～～～～～～～い！",
    "誕生": "翠の星に乗って～",
    "もう丸一日ふたりだけ…": "ちょっとさみしいね…",
    "……リリがいるだけで嬉しいよ…": "うん…私も……",
    "翠の星に乗って～": "あの日のふたりを見に行こう～",
    "やめたほうがいいのに～": "大人達は笑うけど～",
    "藍の鐘で": "また会おう",
    "再会と言えばふたりのシリーズで一番最初の曲だよね～！": "てことは今日は私たちの誕生日みたいなものなのかなぁ…",
    "この曲たちはアルバムが公開されてから2年ほどたってから一般公開されたんだよね～": "リリはわたしの心の中に秘めた気持ちをを歌った曲\nザラザラなギターの音がわたしのナナに対する思いを表していて素敵！",
    "ナナもわたしの内面を歌った曲だよ！\n優しい感じでリリの細やかな描写があってナナのリリへの思いが伝わってくるね\n夜魔はリリに長いこと会えないでいた私の曲だよ\n明るい曲調とは裏腹にちょっと悲しい歌詞がいいよね～": "この曲たちは全部MVはないけれどとてもいい曲だから皆もいっぱい聴いてね！"
}

# 人間への返し:部分一致(30文字以下)
LILI_TO_HUMAN = {
    "スープ": "そのスープ温かいうちに飲むのがいいよ",
    "知りたい": "ふたりのことが知りたいのなら～",
    "大人": "大人になれば～",
    "再会": "約束を",
    "おにぎり": "宇宙が～ふたりきり食べたおにぎりの～",
    "宇宙": "宇宙が～ふたりきり食べたおにぎりの～",
    "信じ": "信じていいと思った～\n信じていいと思った～",
    "イノセンス": "ボロボロになったイノセンスで～\n僕を認めてよ…",
    "夕焼け": "夕焼けに～染まったなら～\n息を止めてくれ",
    "本": "その本が気になるならば読んでもいいよ",
    "銀河": "遥か遠い銀河のなんでもない話だ",
    "瞳": "ただこの冷めた瞳を溶かすのは～\n君のイノセンスが僕を知る時だ～",
    "邪魔": "例えば誰かが僕らの邪魔をしていて",
    "例えば": "例えば\n僕らが\n例えば\n僕らが\n例えば\n例えば\n例えば\n例えば",
    "馬鹿": "あの日大人のふりして逃げた馬鹿な僕を～～\n許して欲しかった～～"
}

# --------------------------------------------------------------------------------------------------------------------------------------------------
# ナナ
# --------------------------------------------------------------------------------------------------------------------------------------------------
# リリ(Bot)の発言への返し:完全一致
NANA_TO_LILI = {
    "ふたりのことが知りたいのなら～": "君もどんな人生だったか話してほしい～",
    "こんな物語をわわすれるくらいなら～": "大人のオの字も知りたくもないのさ～",
    "約束したのだ～": "流れ星の下で…",
    "宇宙が～ふたりきり食べたおにぎりの～": "海苔とかならいいのにね～～",
    "君の青い髪が僕のイノセンスだった": "リリ…！",
    "さんざめくこの世界にさよならを～": "手を繋いだまななら～",
    "二度と～": "来ない～",
    "翠の星に乗って～": "ふたりは一つの愛になる～",
    "大人になれば～": "全部忘れられると思うけど…",
    "約束を": "果たそう",
    "夢のように愛して～\n愛のように夢をみて～": "空想でも信じればいつか叶うからと～\n言ってた～～",
    "普通に笑って普通に泣いて生きてみたかった～": "そんなこと今更叶わないから\n今日も眠りにつく～",
    "冒険しよう～": "ふ～たりは～",
}

# マカロン(Bot)の発言への返し:部分一致
NANA_TO_MAKARON = {
    "再会のリリース日なんだって！": "再会と言えばふたりのシリーズで一番最初の曲だよね～！",
    "約束のリリース日なんだって！": "約束を、果たしに来たんだね…！",
    "一般公開記念日なんだって！": "この曲たちはアルバムが公開されてから2年ほどたってから一般公開されたんだよね～",
}

# 人間への返し:部分一致(30文字以下)
NANA_TO_HUMAN = {
    "彗星": "彗星になれたならいいのに…",
    "水星": "水星にもなりたいなぁ…",
    "水棲": "水には住みたくないなぁ…",
    "翠星": "翠の星に乗って～",
    "水性": "海に溶けちゃう…",
    "後悔": "徒然な後悔も言わないで～",
    "約束": "藍の鐘で",
    "信じ": "信じてなんてないかもね～",
    "夢": "ふたりの～夢を夢を見せよう～",
    "帰": "帰ったほうがいいかもしれない気がしなくもないわ～",
    "普通": "普通に笑って普通に泣いて生きて見たかった～",
    "空想": "空想でも信じればいつか叶うからと～言ってた～",
    "また": "またか～また現れたのか～",
    "怖": "お前なんて怖くないよ",
    "真似": "無理して笑って～無理して泣いて～普通の真似をした～"
}

# --------------------------------------------------------------------------------------------------------------------------------------------------
# マカロン
# --------------------------------------------------------------------------------------------------------------------------------------------------
# Bot(リリ・ナナ)の発言への返し:部分一致
MAKARON_TO_BOT = {}

# 人間への返し:部分一致
MAKARON_TO_HUMAN = {}
